<a href="https://colab.research.google.com/github/hamdi-trikii/DLSI-ADBD-S2/blob/main/AFD/AFD_TP0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9.0, 16.5, np.nan, 9.0, 20.0, 14.5, np.nan, 8.0, 19.0],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
"""
df2=df.to_string(index=False)
print(type(df2))
"""
"""
label=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, label)

"""

# Afficher le DataFrame
print(df)

        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:

print(df.info())
print("*******************")
print(df.head())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None
*******************
        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [ ]:

first_3_rows = df.head(3)
#another methode (prof)
#print(df.iloc[:3])
print(first_3_rows)
print('**************************')
df['Nord'] = df['Name'].str.startswith(('A', 'K', 'M'))
print(df)
print('**************************')
df.drop('Nord', axis=1, inplace=True)
print(df)

        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
**************************
        Name  score  attempts qualify   Nord
a  Anastasia   12.5         1     yes   True
b       Dima    9.0         3      no  False
c  Katherine   16.5         2     yes   True
d      James    NaN         3      no  False
e      Emily    9.0         2      no  False
f    Michael   20.0         3     yes   True
g    Matthew   14.5         1     yes   True
h      Laura    NaN         1      no  False
i      Kevin    8.0         2      no   True
j      Jonas   19.0         1     yes  False
**************************
        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
selected_columns = df[['Name', 'score']]
print(selected_columns)

        Name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [ ]:
selected_rows_columns = df.loc[df.index[[1, 3, 5, 6]], ['Name', 'score']]
print(selected_rows_columns )

      Name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [ ]:
selected_attempts_gt_2 = df[df['attempts'] > 2]
print(selected_attempts_gt_2 )

      Name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [ ]:
""" another methode
nbligne=len(df.axes[0])
nbcolone=len(df.axes[1])
print(nbligne,nbcolone)
"""
num_rows, num_columns = df.shape
print("num_rows:",num_rows,", num_columns:", num_columns)

num_rows: 10 , num_columns: 4

In [ ]:
missing_score_rows = df[df['score'].isna()]
print(missing_score_rows)

    Name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [ ]:
selected_score_between_15_20 = df[(df['score'] >= 15) & (df['score'] <= 20)]
"""
s_score_15_20= df[df['score'].between(15,20)]
print(s_score_15_20)
"""
print(selected_score_between_15_20)

        Name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
selected_attempts_lt_2_score_gt_15 = df[(df['attempts'] < 2) | (df['score'] > 15)]

print(selected_attempts_lt_2_score_gt_15 )

        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
j      Jonas   19.0         1     yes

In [ ]:

df.at['d', 'score'] = 11.5
#df.loc['d','score']=7
print(df)

        Name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
sum_attempts = df['attempts'].sum()
print(sum_attempts )

19

In [ ]:
mean_score = df['score'].mean()
print(mean_score)

13.333333333333334

In [ ]:
df.loc['k']=['hamdi','5','3','yes']
print(df)

        Name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k      hamdi     5        3     yes

In [ ]:
df = df.drop('k')
print(df)

        Name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

In [ ]:
df_sorted_by_name = df.sort_values(by='Name')
print(df_sorted_by_name)

        Name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
e      Emily   9.0        2      no
d      James  11.5        3      no
j      Jonas  19.0        1     yes
c  Katherine  16.5        2     yes
i      Kevin   8.0        2      no
h      Laura   NaN        1      no
g    Matthew  14.5        1     yes
f    Michael  20.0        3     yes

In [ ]:
df_sorted_by_score_desc = df.sort_values(by='score', ascending=False)
print(df_sorted_by_score_desc)

        Name  score  attempts qualify
5    Michael   20.0         3     yes
9      Jonas   19.0         1     yes
2  Katherine   16.5         2     yes
6    Matthew   14.5         1     yes
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
4      Emily    9.0         2      no
8      Kevin    8.0         2      no
3      James    NaN         3      no
7      Laura    NaN         1      no

In [ ]:
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        Name  score  attempts  qualify
0  Anastasia   12.5         1     True
1       Dima    9.0         3    False
2  Katherine   16.5         2     True
3      James    NaN         3    False
4      Emily    9.0         2    False
5    Michael   20.0         3     True
6    Matthew   14.5         1     True
7      Laura    NaN         1    False
8      Kevin    8.0         2    False
9      Jonas   19.0         1     True

In [ ]:
df.loc[df['Name'] == 'James', 'Name'] = 'Suresh'
print(df)

        Name  score  attempts  qualify
0  Anastasia   12.5         1     True
1       Dima    9.0         3    False
2  Katherine   16.5         2     True
3     Suresh    NaN         3    False
4      Emily    9.0         2    False
5    Michael   20.0         3     True
6    Matthew   14.5         1     True
7      Laura    NaN         1    False
8      Kevin    8.0         2    False
9      Jonas   19.0         1     True

In [ ]:
df = df.drop('attempts', axis=1)
print(df)

        Name  score  qualify
0  Anastasia   12.5     True
1       Dima    9.0    False
2  Katherine   16.5     True
3     Suresh    NaN    False
4      Emily    9.0    False
5    Michael   20.0     True
6    Matthew   14.5     True
7      Laura    NaN    False
8      Kevin    8.0    False
9      Jonas   19.0     True

In [ ]:
df['new_column'] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(df)

        Name  score  qualify  new_column
0  Anastasia   12.5     True           1
1       Dima    9.0    False           2
2  Katherine   16.5     True           3
3     Suresh    NaN    False           4
4      Emily    9.0    False           5
5    Michael   20.0     True           6
6    Matthew   14.5     True           7
7      Laura    NaN    False           8
8      Kevin    8.0    False           9
9      Jonas   19.0     True          10

In [ ]:
for index, row in df.iterrows():
    print(row['Name'], row['score'], row['qualify'])

Anastasia 12.5 True
Dima 9.0 False
Katherine 16.5 True
Suresh nan False
Emily 9.0 False
Michael 20.0 True
Matthew 14.5 True
Laura nan False
Kevin 8.0 False
Jonas 19.0 True

In [ ]:
df = df.fillna(0)
print(df)

        Name  score  qualify  new_column
0  Anastasia   12.5     True           1
1       Dima    9.0    False           2
2  Katherine   16.5     True           3
3     Suresh    0.0    False           4
4      Emily    9.0    False           5
5    Michael   20.0     True           6
6    Matthew   14.5     True           7
7      Laura    0.0    False           8
8      Kevin    8.0    False           9
9      Jonas   19.0     True          10

In [ ]:
df.at['d', 'score'] = 11.5
print(df)

        Name  score qualify  new_column
0  Anastasia   12.5    True         1.0
1       Dima    9.0   False         2.0
2  Katherine   16.5    True         3.0
3     Suresh    0.0   False         4.0
4      Emily    9.0   False         5.0
5    Michael   20.0    True         6.0
6    Matthew   14.5    True         7.0
7      Laura    0.0   False         8.0
8      Kevin    8.0   False         9.0
9      Jonas   19.0    True        10.0
d        NaN   11.5     NaN         NaN

In [ ]:
nan_count = df['score'].isna().sum()
print(nan_count)

0

In [ ]:
column_headers = df.columns.tolist()

print(column_headers)

['Name', 'score', 'qualify', 'new_column']

In [ ]:
df = df.rename(columns={'Name': 'StudentName', 'score': 'Score', 'qualify': 'Qualified'})
print(df)

  StudentName  Score Qualified  new_column
0   Anastasia   12.5      True         1.0
1        Dima    9.0     False         2.0
2   Katherine   16.5      True         3.0
3      Suresh    0.0     False         4.0
4       Emily    9.0     False         5.0
5     Michael   20.0      True         6.0
6     Matthew   14.5      True         7.0
7       Laura    0.0     False         8.0
8       Kevin    8.0     False         9.0
9       Jonas   19.0      True        10.0
d         NaN   11.5       NaN         NaN

In [ ]:
selected_rows = df[df['Score'] > 15]
print(selected_rows )

  StudentName  Score Qualified  new_column
2   Katherine   16.5      True         3.0
5     Michael   20.0      True         6.0
9       Jonas   19.0      True        10.0

In [ ]:
df = df[['Score', 'Qualified', 'StudentName']]
print(df)

   Score Qualified StudentName
0   12.5      True   Anastasia
1    9.0     False        Dima
2   16.5      True   Katherine
3    0.0     False      Suresh
4    9.0     False       Emily
5   20.0      True     Michael
6   14.5      True     Matthew
7    0.0     False       Laura
8    8.0     False       Kevin
9   19.0      True       Jonas
d   11.5       NaN         NaN